### Reading CSV and TXT files

In [1]:
import pandas as pd
import numpy as np

In [2]:
with open('data/btc-market-price.csv') as fp:
    print(fp)

<_io.TextIOWrapper name='data/btc-market-price.csv' mode='r' encoding='cp1252'>

In [8]:
with open('data/btc-market-price.csv') as fp:
    for index, time in enumerate(fp.readlines()):
        if (index < 10):
            print(index, time)

0 2017-04-02 00:00:00,1099.169125

1 2017-04-03 00:00:00,1141.813

2 2017-04-04 00:00:00,1141.6003625

3 2017-04-05 00:00:00,1133.0793142857142

4 2017-04-06 00:00:00,1196.3079375

5 2017-04-07 00:00:00,1190.45425

6 2017-04-08 00:00:00,1181.1498375

7 2017-04-09 00:00:00,1208.8005

8 2017-04-10 00:00:00,1207.744875

9 2017-04-11 00:00:00,1226.6170375

0

In [9]:
# Reading our first CSV file

csv_url = "https://raw.githubusercontent.com/datasets/gdp/master/data/gdp.csv"

pd.read_csv(csv_url).head()

  Country Name Country Code  Year         Value
0   Arab World          ARB  1968  2.576068e+10
1   Arab World          ARB  1969  2.843420e+10
2   Arab World          ARB  1970  3.138550e+10
3   Arab World          ARB  1971  3.642691e+10
4   Arab World          ARB  1972  4.331606e+10

In [16]:
df = pd.read_csv('data/btc-market-price.csv', header=None)
df.head()

                     0            1
0  2017-04-02 00:00:00  1099.169125
1  2017-04-03 00:00:00  1141.813000
2  2017-04-04 00:00:00  1141.600363
3  2017-04-05 00:00:00  1133.079314
4  2017-04-06 00:00:00  1196.307937

In [17]:
df = pd.read_csv('data/btc-market-price.csv', header=None,
                na_values=['', '?', '-'])

In [22]:
df = pd.read_csv('data/btc-market-price.csv', header=None,
                na_values=['', '?', '-'],
                names=['Timestamp', 'Price'])

df.head()

             Timestamp        Price
0  2017-04-02 00:00:00  1099.169125
1  2017-04-03 00:00:00  1141.813000
2  2017-04-04 00:00:00  1141.600363
3  2017-04-05 00:00:00  1133.079314
4  2017-04-06 00:00:00  1196.307937

In [23]:
df = pd.read_csv('data/btc-market-price.csv', header=None,
                na_values=['', '?', '-'],
                names=['Timestamp', 'Price'],
                dtype={'Price': 'float'})

df.head()

             Timestamp        Price
0  2017-04-02 00:00:00  1099.169125
1  2017-04-03 00:00:00  1141.813000
2  2017-04-04 00:00:00  1141.600363
3  2017-04-05 00:00:00  1133.079314
4  2017-04-06 00:00:00  1196.307937

In [25]:
df['Price'].head()

0    1099.169125
1    1141.813000
2    1141.600363
3    1133.079314
4    1196.307937
Name: Price, dtype: float64

In [28]:
df.dtypes

Timestamp     object
Price        float64
dtype: object

In [29]:
# lets convert the Timestamp column to datatime object
df['Timestamp'] = pd.to_datetime(df['Timestamp'])

In [30]:
df['Timestamp'].head()

0   2017-04-02
1   2017-04-03
2   2017-04-04
3   2017-04-05
4   2017-04-06
Name: Timestamp, dtype: datetime64[ns]

### Date parser using parse_dates parameter
Another way of dealing with Datetime objects is using parse_dates parameter with the position of the columns with dates.

In [34]:
df = pd.read_csv('data/btc-market-price.csv',
                header=None,
                 names=['Timestamp', 'Price'],
                na_values=['', '?', '-'],
                dtype={'Price': 'float'},
                parse_dates=[0])

df.head(3)

   Timestamp        Price
0 2017-04-02  1099.169125
1 2017-04-03  1141.813000
2 2017-04-04  1141.600363

In [36]:
df = pd.read_csv('data/btc-market-price.csv',
                header=None,
                 names=['Timestamp', 'Price'],
                na_values=['', '?', '-'],
                dtype={'Price': 'float'},
                parse_dates=[0],
                index_col=[0])

df.head()

                  Price
Timestamp
2017-04-02  1099.169125
2017-04-03  1141.813000
2017-04-04  1141.600363
2017-04-05  1133.079314
2017-04-06  1196.307937

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

## A more challenging parsing

Now we'll read another CSV file. This file has the following columns:

- `first_name`
- `last_name`
- `age`
- `math_score`
- `french_score`
- `next_test_date`

Let's read it and see how it looks like.

In [37]:
exam_df = pd.read_csv('data/exam_review.csv')
exam_df

                               first_name>last_name>age>math_score>french_score
Ray>Morley>18>"68     000">"75                                             000"
Melvin>Scott>24>77>83 NaN                                                   NaN
Amirah>Haley>22>92>67 NaN                                                   NaN
Gerard>Mills>19>"78   000">72                                               NaN
Amy>Grimes>23>91>81   NaN                                                   NaN

In [38]:
exam_df = pd.read_csv('data/exam_review.csv',
                     sep='>')

In [39]:
exam_df

  first_name last_name  age math_score french_score
0        Ray    Morley   18     68,000       75,000
1     Melvin     Scott   24         77           83
2     Amirah     Haley   22         92           67
3     Gerard     Mills   19     78,000           72
4        Amy    Grimes   23         91           81

In [42]:
exam_df[['math_score', 'french_score']].dtypes

math_score      object
french_score    object
dtype: object

In [43]:
exam_df = pd.read_csv('data/exam_review.csv',
                     sep='>',
                     decimal=',')

In [44]:
exam_df

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18        68.0          75.0
1     Melvin     Scott   24        77.0          83.0
2     Amirah     Haley   22        92.0          67.0
3     Gerard     Mills   19        78.0          72.0
4        Amy    Grimes   23        91.0          81.0

In [45]:
exam_df = pd.read_csv('data/exam_review.csv',
                     sep='>',
                     thousands=',')

In [46]:
exam_df

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18       68000         75000
1     Melvin     Scott   24          77            83
2     Amirah     Haley   22          92            67
3     Gerard     Mills   19       78000            72
4        Amy    Grimes   23          91            81

In [49]:
exam_df = pd.read_csv('data/exam_review.csv',
                      sep='>',
                      decimal=',',
                      skiprows=[1,3])
exam_df

  first_name last_name  age  math_score  french_score
0     Melvin     Scott   24        77.0            83
1     Gerard     Mills   19        78.0            72
2        Amy    Grimes   23        91.0            81

In [50]:
# Loading specific columns

pd.read_csv('data/exam_review.csv',
           usecols=['first_name', 'french_score'],
           sep='>')

  first_name french_score
0        Ray       75,000
1     Melvin           83
2     Amirah           67
3     Gerard           72
4        Amy           81

In [59]:
# the squeeze parameter converts dataframe into series if only 
# one column in selected
exam_df_2 = pd.read_csv('data/exam_review.csv',
                          sep='>',
                          usecols=['last_name'],
                          squeeze=True)

In [60]:
type(exam_df_2)

pandas.core.series.Series

In [63]:
# lets save our work again as csv file
exam_df.to_csv('data/out.csv', index=None)

In [64]:
pd.read_csv('data/out.csv')

  first_name last_name  age  math_score  french_score
0     Melvin     Scott   24        77.0            83
1     Gerard     Mills   19        78.0            72
2        Amy    Grimes   23        91.0            81